[
    "What time did the man go to the dentist? Tooth hurt-y",
    "I'm reading a book about anti-gravity. It's impossible to put down!",
    "Want to hear a joke about a piece of paper? Never mind... it's tearable.",
    "I just watched a documentary about beavers. It was the best dam show I ever saw!",
    "If you see a robbery at an Apple Store does that make you an iWitness?",
    "Spring is here! I got so excited I wet my plants!",
    "A ham sandwich walks into a bar and orders a beer. The bartender says, \"Sorry we don’t serve food here.\"",
    "What’s Forrest Gump’s password? 1forrest1",
    "I bought some shoes from a drug dealer. I don't know what he laced them with, but I was tripping all day!",
    "Why do chicken coops only have two doors? Because if they had four, they would be chicken sedans!",
    "What do you call a factory that sells passable products? A satisfactory.",
    "A termite walks into a bar and asks, \"Is the bar tender here?\"",
    "When a dad drives past a graveyard: Did you know that's a popular cemetery? Yep, people are just dying to get in there!",
    "Two peanuts were walking down the street. One was a salted.",
    "Why did the invisible man turn down the job offer? He couldn't see himself doing it.",
    "I used to have a job at a calendar factory but I got the sack because I took a couple of days off.",
    "How do you make holy water? You boil the hell out of it.",
    "A three-legged dog walks into a bar and says to the bartender, \"I’m looking for the man who shot my paw.\"",
    "When you ask a dad if he's alright: \"No, I’m half left.\"",
    "I had a dream that I was a muffler last night. I woke up exhausted!",
    "How do you tell the difference between a frog and a horny toad? A frog says, \"Ribbit, ribbit\" and a horny toad says, \"Rub it, rub it.\"",
    "Did you hear the news? FedEx and UPS are merging. They’re going to go by the name Fed-Up from now on.",
    "5/4 of people admit that they’re bad with fractions.",
    "MOM: \"How do I look?\" DAD: \"With your eyes.\"",
    "What is Beethoven’s favorite fruit? A ba-na-na-na.",
    "What did the horse say after it tripped? \"Help! I’ve fallen and I can’t giddyup!\"",
    "Did you hear about the circus fire? It was in tents!",
    "Don't trust atoms. They make up everything!",
    "What do you get when you cross an elephant with a rhino? Elephino.",
    "How many tickles does it take to make an octopus laugh? Ten-tickles.",
    "What's the best part about living in Switzerland? I don't know, but the flag is a big plus.",
    "What do prisoners use to call each other? Cell phones.",
    "Why couldn't the bike standup by itself? It was two tired.",
    "What do you call a dog that can do magic? A Labracadabrador.",
    "Why didn't the vampire attack Taylor Swift? She had bad blood.",
    "NURSE: \"Blood type?\" DAD: \"Red.\"",
    "SERVER: \"Sorry about your wait.\" DAD: \"Are you saying I’m fat?\"",
    "What do you call a fish with two knees? A “two-knee” fish.",
    "I was interrogated over the theft of a cheese toastie. Man, they really grilled me.",
    "What do you get when you cross a snowman with a vampire? Frostbite.",
    "Can February March? No, but April May!",
    "When you ask a dad if they got a haircut: \"No, I got them all cut!\"",
    "What does a zombie vegetarian eat? “GRRRAAAAAIIIINNNNS!”",
    "What does an angry pepper do? It gets jalapeño your face.",
    "Why wasn't the woman happy with the velcro she bought? It was a total ripoff.",
    "What did the buffalo say to his son when he dropped him off at school? Bison.",
    "What do you call someone with no body and no nose? Nobody knows.",
    "Where did the college-aged vampire like to shop? Forever 21.",
    "You heard of that new band 1023MB? They're good but they haven't got a gig yet.",
    "Why did the crab never share? Because he's shellfish.",
    "How do you make poop water clean? You boil the shit out of it.",
    "Did you hear about the restaurant on the moon? Great food, no atmosphere.",
    "What do you call a fake noodle? An Impasta.",
    "How many apples grow on a tree? All of them.",
    "Want to hear a joke about paper? Nevermind it's tearable.",
    "I just watched a program about beavers. It was the best dam program I've ever seen.",
    "Why did the coffee file a police report? It got mugged.",
    "How does a penguin build it's house? Igloos it together.",
    "Dad, did you get a haircut? No I got them all cut.",
    "What do you call a Mexican who has lost his car? Carlos.",
    "Dad, can you put my shoes on? No, I don't think they'll fit me.",
    "Why did the scarecrow win an award? Because he was outstanding in his field.",
    "Why don't skeletons ever go trick or treating? Because they have no body to go with.",
    "Ill call you later. Don't call me later, call me Dad.",
    "What do you call an elephant that doesn't matter? An irrelephant",
    "Want to hear a joke about construction? I'm still working on it.",
    "What do you call cheese that isn't yours? Nacho Cheese.",
    "Why couldn't the bicycle stand up by itself? It was two tired.",
    "What did the grape do when he got stepped on? He let out a little wine.",
    "I wouldn't buy anything with velcro. It's a total rip-off.",
    "The shovel was a ground-breaking invention.",
    "Dad, can you put the cat out? I didn't know it was on fire.",
    "This graveyard looks overcrowded. People must be dying to get in there.",
    "Whenever the cashier at the grocery store asks my dad if he would like the milk in a bag he replies, \"No, just leave it in the carton!\"",
    "5/4 of people admit that they’re bad with fractions.",
    "Two goldfish are in a tank. One says to the other, \"do you know how to drive this thing?\"",
    "What do you call a man with a rubber toe? Roberto.",
    "What do you call a fat psychic? A four-chin teller.",
    "I would avoid the sushi if I was you. It’s a little fishy.",
    "To the man in the wheelchair that stole my camouflage jacket... You can hide but you can't run.",
    "The rotation of earth really makes my day.",
    "I thought about going on an all-almond diet. But that's just nuts",
    "What's brown and sticky? A stick.",
    "I’ve never gone to a gun range before. I decided to give it a shot!",
    "Why do you never see elephants hiding in trees? Because they're so good at it.",
    "Did you hear about the kidnapping at school? It's fine, he woke up.",
    "A furniture store keeps calling me. All I wanted was one night stand.",
    "I used to work in a shoe recycling shop. It was sole destroying.",
    "Did I tell you the time I fell in love during a backflip? I was heels over head.",
    "I don’t play soccer because I enjoy the sport. I’m just doing it for kicks.",
    "People don’t like having to bend over to get their drinks. We really need to raise the bar."
]